**`nomis-test`** terraform plan on `pull_request` event [#3347](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4255571204)

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cert_expires_in_2_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_2_days" {
      ~ alarm_name                            = "cert_expires_in_2_days" -> "cert-expires-in-2-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:cert_expires_in_2_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_2_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cert_expires_in_30_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_30_days" {
      ~ alarm_name                            = "cert_expires_in_30_days" -> "cert-expires-in-30-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:cert_expires_in_30_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_30_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_dns must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_dns" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_dns" -> "load-balancer-unhealthy-state-dns" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:load_balancer_unhealthy_state_dns" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_dns" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_routing must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_routing" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_routing" -> "load-balancer-unhealthy-state-routing" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:load_balancer_unhealthy_state_routing" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_routing" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_target must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_target" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_target" -> "load-balancer-unhealthy-state-target" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:load_balancer_unhealthy_state_target" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_target" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-usage-iowait"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of CPU time spent waiting for I/O to complete. If the average CPU time spent waiting for I/O to complete is greater than 90% for 30 minutes, the alarm will trigger."
      + alarm_name                            = "t1-nomis-db-1_cpu-usage-iowait"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 6
      + id                                    = (known after apply)
      + metric_name                           = "cpu_usage_iowait"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu-utilization"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "Triggers if the average cpu remains at 95% utilization or above for 15 minutes"
      + alarm_name                            = "t1-nomis-db-1_cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 15
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 15
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 95
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu_usage_iowait"] will be destroyed
  # (because key ["cpu_usage_iowait"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of CPU time spent waiting for I/O to complete. If the average CPU time spent waiting for I/O to complete is greater than 90% for 30 minutes, the alarm will trigger." -> null
      - alarm_name                = "cpu_usage_iowait" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:cpu_usage_iowait" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-09bba03659a0990da"
        } -> null
      - evaluation_periods        = 6 -> null
      - id                        = "cpu_usage_iowait" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "cpu_usage_iowait" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 90 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["cpu_utilization"] will be destroyed
  # (because key ["cpu_utilization"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "Triggers if the average cpu remains at 95% utilization or above for 15 minutes" -> null
      - alarm_name                = "cpu_utilization" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:cpu_utilization" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 15 -> null
      - dimensions                = {
          - "InstanceId" = "i-0c19b8c4130ab7e31"
        } -> null
      - evaluation_periods        = 15 -> null
      - id                        = "cpu_utilization" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/EC2" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 95 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["disk-used-percent"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space is above 85% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4289822860/Disk+Free+alarm+-+Linux"
      + alarm_name                            = "t1-nomis-db-1_disk-used-percent"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "disk_used_percent"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["disk_used_percent"] will be destroyed
  # (because key ["disk_used_percent"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space is above 85% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4289822860/Disk+Free+alarm+-+Linux" -> null
      - alarm_name                = "disk_used_percent" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:disk_used_percent" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {
          - "InstanceId" = "i-0c19b8c4130ab7e31"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "disk_used_percent" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "disk_used_percent" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 85 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["high-memory-usage"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of available memory. If the amount of available memory is greater than 90% for 2 minutes, the alarm will trigger."
      + alarm_name                            = "t1-nomis-db-1_high-memory-usage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "mem_used_percent"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 90
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["high_memory_usage"] will be destroyed
  # (because key ["high_memory_usage"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of available memory. If the amount of available memory is greater than 90% for 2 minutes, the alarm will trigger." -> null
      - alarm_name                = "high_memory_usage" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:high_memory_usage" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {
          - "InstanceId" = "i-09bba03659a0990da"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "high_memory_usage" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "mem_used_percent" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 90 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["instance-health-check-failed"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "Instance status checks monitor the software and network configuration of your individual instance. When an instance status check fails, you typically must address the problem yourself: https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring-system-instance-status-check.html"
      + alarm_name                            = "t1-nomis-db-1_instance-health-check-failed"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "StatusCheckFailed_Instance"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["instance_health_check_failed"] will be destroyed
  # (because key ["instance_health_check_failed"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "Instance status checks monitor the software and network configuration of your individual instance. When an instance status check fails, you typically must address the problem yourself: https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/monitoring-system-instance-status-check.html" -> null
      - alarm_name                = "instance_health_check_failed" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:instance_health_check_failed" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "InstanceId" = "i-09bba03659a0990da"
        } -> null
      - evaluation_periods        = 3 -> null
      - id                        = "instance_health_check_failed" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "StatusCheckFailed_Instance" -> null
      - namespace                 = "AWS/EC2" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-batch-error"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps."
      + alarm_name                            = "t1-nomis-db-1_oracle-batch-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
          + "instance"   = "batch_error"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-db-disconnected"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db connection to a particular SID is not working. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4294246698/Oracle+db+connection+alarm for remediation steps."
      + alarm_name                            = "t1-nomis-db-1_oracle-db-disconnected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
          + "instance"   = "db_connected"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle-monitoring-file_error"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ]
      + alarm_description                     = "Oracle db monitoring file doesn't exist. Usually indicates that the oracle setup hasn't completed fully."
      + alarm_name                            = "t1-nomis-db-1_oracle-monitoring-file_error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 20
      + dimensions                            = {
          + "InstanceId" = "i-0d66a5e9c6eb72815"
          + "instance"   = "file_error"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 20
      + id                                    = (known after apply)
      + metric_name                           = "collectd_exec_value"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle_batch_error"] will be destroyed
  # (because key ["oracle_batch_error"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db is either in long-running batch or failed batch status. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4295000327/Oracle+Batch+alert for remediation steps." -> null
      - alarm_name                = "oracle_batch_error" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:oracle_batch_error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-0c19b8c4130ab7e31"
          - "instance"   = "batch_error"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "oracle_batch_error" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.db_ec2_instance["t1-nomis-db-1"].aws_cloudwatch_metric_alarm.this["oracle_db_disconnected"] will be destroyed
  # (because key ["oracle_db_disconnected"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:612659970365:nomis_alarms",
        ] -> null
      - alarm_description         = "Oracle db connection to a particular SID is not working. See: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4294246698/Oracle+db+connection+alarm for remediation steps." -> null
      - alarm_name                = "oracle_db_disconnected" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:612659970365:alarm:oracle_db_disconnected" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "InstanceId" = "i-0d66a5e9c6eb72815"
          - "instance"   = "db_connected"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "oracle_db_disconnected" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "collectd_exec_value" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic
```
** Truncated output.  See https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4255571204 for the rest **
